package game

var koreanPool = []rune {

	// 고빈도 음절
	'하', '리', '지', '이', '기', '사', '자', '시', '수', '대', 
	'가', '부', '제', '카', '고', '주', '도', '무', '비', '구', 
	'소', '치', '유', '거', '조', '파', '서', '나', '다', '미', 
	'스', '보', '내', '마', '세', '어', '아', '라', '키', '니', 
	'모', '그', '우', '저', '러', '레', '차', '교', '타', '오',
	'적', '정', '상', '장', '전', '동', '인', '공', '신', '물',
	'문', '선', '일', '원', '경', '명', '실', '연', '중', '발',
	'방', '불', '관', '단', '산', '개', '화', '성', '체',

	// 겹받침
	'밝', '읽', '넓', '삶', '값', '없', '젊',
	
	// 저빈도 단일 받침
	'밤', '빛', '꽃', '숲', '낮', '옷', '잎', '별', '달', '눈',

	// 이중 모음
	'귀', '뒤', '쉬', '왜', '위',

	// 쌍 자음 초성
	'꿈', '쓴', '뜻', '빵', '짝',
}

var englishPool = []rune {
	'A', 'B', 'C', 'D', 'E', 'F', 'G',
	'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P',
	'Q', 'R', 'S', 'T', 'U', 'W', 'X', 'Y', 'Z',
}

var digitPool = []rune {
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
}